app/Controllers/Guru.php

    public function index()
    {
        $data = [
            'title' => 'Absensi',
            'subtitle' => 'Guru',
            'guru' => $this->Model_guru->findAll(),
            'role' => $this->Model_role->findAll(),
---
SELECT *
FROM `tb_guru`
SELECT *
FROM `tb_role`