app/Controllers/Kelas.php

    public function index()
    {
        $data = [
            'title' => 'Absensi',
            'subtitle' => 'Kelas',
            'kelas' => $this->Model_kelas->getKelas(),
            'w_kelas' => $this->Model_guru->findAll(),
            'tahun_ajar' => $this->Model_tahun_ajar->findAll(),
        ];
---
SELECT *
FROM `tb_guru`
SELECT *
FROM `tb_kelas`

    public function insertData()
    {
        $data = [
            'kelas_kode' => $this->request->getPost('kelas_kode'),
            'kelas_nama' => $this->request->getPost('kelas_nama'),
            'kelas_grade' => $this->request->getPost('kelas_grade'),
            'wali_kelas' => $this->request->getPost('wali_kelas'),
            'tahun_ajaran' => $this->request->getPost('tahun_ajaran'),
        ];
        $this->Model_kelas->insert($data);
---
INSERT INTO `tb_kelas` (`kelas_kode`, `kelas_nama`, `wali_kelas`, `tahun_ajaran`) VALUES ('a124', '12Mipa5', '2', '1')

    public function editData($kelas_id)
    {
        $data = [
            'kelas_kode' => $this->request->getPost('kelas_kode'),
            'kelas_nama' => $this->request->getPost('kelas_nama'),
            'kelas_grade' => $this->request->getPost('kelas_grade'),
            'wali_kelas' => $this->request->getPost('wali_kelas'),
            'tahun_ajaran' => $this->request->getPost('tahun_ajaran'),

        ];
        $this->Model_kelas->update($kelas_id, $data);
---
UPDATE `tb_kelas` SET `kelas_kode` = 'A125', `kelas_nama` = '12IPA5', `kelas_grade` = '12', `wali_kelas` = '3', `tahun_ajaran` = '1'
WHERE `tb_kelas`.`kelas_id` IN ('4')