app/Controllers/Login.php

    public function index()
    {
        if (session('log_auth')) {
            return redirect()->to(base_url('/'));
        }

        $validation = $this->validation;
        if (session('validation')) {
            $validation = session('validation');
        }

        $data = [
            'title' => 'Absensi',
            'subtitle' => 'Login',
            'guru' => $this->Model_guru->findAll(),
            'role' => $this->Model_role->findAll(),
            'validation' => $validation
        ];
---
SELECT *
FROM `tb_guru`
SELECT *
FROM `tb_role`