app/Controllers/Mapel.php

    public function index()
    {
        $data = [
            'title' => 'Absensi',
            'subtitle' => 'Mata Pelajaran',
            'mapel' => $this->Model_mapel->findAll(),
---
SELECT *
FROM `tb_mapel`