app/Controllers/Siswa.php

    public function index()
    {
        $data = [
            'title' => 'Absensi',
            'subtitle' => 'Siswa',
            'siswa' => $this->Model_siswa->findAll(),
            'kelas' => $this->Model_kelas->findAll(),
---
SELECT *
FROM `tb_siswa`
SELECT *
FROM `tb_kelas`

    public function insertData()
    {
        $file = $this->request->getFile('siswa_foto');
        $nama_file = $file->getRandomName();
        $data = [
            'siswa_nis' => $this->request->getPost('siswa_nis'),
            'siswa_nama' => $this->request->getPost('siswa_nama'),
            'siswa_tempat_lahir' => $this->request->getPost('siswa_tempat_lahir'),
            'siswa_tgl_lahir' => $this->request->getPost('siswa_tgl_lahir'),
            'siswa_jk' => $this->request->getPost('siswa_jk'),
            'siswa_alamat' => $this->request->getPost('siswa_alamat'),
            'siswa_th_angkatan' => $this->request->getPost('siswa_th_angkatan'),
            'siswa_id_kelas' => $this->request->getPost('siswa_id_kelas'),
            'siswa_foto' => $nama_file,
        ];
        $file->move('foto_siswa/', $nama_file);
        $this->Model_siswa->insert($data);
---
INSERT INTO `tb_siswa` (`siswa_nis`, `siswa_nama`, `siswa_tempat_lahir`, `siswa_tgl_lahir`, `siswa_jk`, `siswa_alamat`, `siswa_th_angkatan`, `siswa_id_kelas`, `siswa_foto`) VALUES ('5190411039', 'Yusuf Septian', 'semarang', '2022-11-21', 'Laki-Laki', 'mtl', '2019', '3', '1669015144_139215f2e79e91c3785d.png')