app/Models/Model_guru.php

SELECT *
FROM `tb_guru`
JOIN `tb_role` ON `tb_role`.`role_id`=`tb_guru`.`guru_role`
---
    public function getDataGuru()
    {
        return $this->db->table('tb_guru')
            ->join('tb_role', 'tb_role.role_id=tb_guru.guru_role')
            ->get()->getResultArray();