app/Models/Model_siswa.php

SELECT *
FROM `tb_siswa`
JOIN `tb_kelas` ON `tb_kelas`.`kelas_id`=`tb_siswa`.`siswa_id_kelas`
JOIN `tb_tahun_ajaran` ON `tb_tahun_ajaran`.`th_id`=`tb_siswa`.`siswa_th_angkatan`
---
    public function getKelasSiswa()
    {
        return $this->db->table('tb_siswa')
            ->join('tb_kelas', 'tb_kelas.kelas_id=tb_siswa.siswa_id_kelas')
            ->get()->getResultArray();